УТ_для_edt.РасширениеСмарт/src/DataProcessors/смартИнтерактивнаяКартаЯндекс/смартИнтерактивнаяКартаЯндекс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартИнтерактивнаяКартаЯндекс</name>
  <comment>//--#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248) -> //смарт:Фролов #1248 //Заявки инженеров на Яндекс карте</comment>
  <tabularSections>
    <name>Заявки</name>
    <attributes>
      <name>Партнер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресВыезда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.смартСтатусыЗаявокНаРемонтныеРаботы</types>
        <types>EnumRef.смартСтатусыЗаявокНаПускоНаладку</types>
      </type>
    </attributes>
    <attributes>
      <name>Инженер1</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Инженер2</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРемонтаС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидГарантии</name>
      <type>
        <types>EnumRef.смартВидыГарантии</types>
      </type>
    </attributes>
    <attributes>
      <name>Широта</name>
      <comment>//++ #1248 смарт: Фролов 07.12.2022</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <comment>//++ #1248 смарт: Фролов 07.12.2022</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.смартЗаявкаНаРемонтныеРаботы</types>
        <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПеречисление</name>
      <type>
        <types>EnumRef.смартСтатусыЗаявокНаРемонтныеРаботы</types>
        <types>EnumRef.смартСтатусыЗаявокНаПускоНаладку</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеНайденыКоординаты</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/смартИнтерактивнаяКартаЯндекс/Forms/Форма/Module.bsl
//++#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
// Проведен полный рефакторинг обработки.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	УстановитьТексты();
	ПолучитьОстаткиЗапросов(); 
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеКартыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка) 
	
	// После того, как пользователь нажал на точку в поле карты, переходим к соответствующей заявке в таблице
	ПервыйСимвол = СтрНайти(Элемент.Документ.activeElement.outerText, "№ заявки: ") + 10;
	ВторойСимвол = СтрНайти(Элемент.Документ.activeElement.outerText, ",",, ПервыйСимвол);
	НомерЗаявки = Сред(Элемент.Документ.activeElement.outerText, ПервыйСимвол, ВторойСимвол - ПервыйСимвол);
	 
	СтрокиЗаявки = Объект.Заявки.НайтиСтроки(Новый Структура("Номер", НомерЗаявки)); 
	
	Если СтрокиЗаявки.Количество() > 0 Тогда
		Элементы.Заявки.ТекущаяСтрока = СтрокиЗаявки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиПриАктивизацииСтроки(Элемент)
		
	Если ЭтаФорма.ТекущийЭлемент.Имя = "ПолеКарты" Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрокаТаблицыЗаявки = ЭтаФорма.Элементы.Заявки.ТекущиеДанные;
	
	Если ТекущаяСтрокаТаблицыЗаявки = Неопределено
		 Или ТекущаяСтрокаТаблицыЗаявки.Широта = 0 
		Тогда
		
		ПолеКарты = "";
		Возврат;
		
	КонецЕсли;
	
	ОбновитьКарту(ТекущаяСтрокаТаблицыЗаявки.Заявка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 

	ОткрытьЗначение(Элемент.ТекущиеДанные.Заявка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда) 
	
	ПолучитьДанныеДляВыводаТочек(); 
	ПолучитьОстаткиЗапросов();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаЛегендаОткрытьЗакрыть(Команда)

	Открыть = Команда.Имя = "ЛегендаОткрыть";
	
	Элементы.ПолеЛегенды.Видимость = Открыть;
	Элементы.ЛегендаОткрыть.Видимость = Не Открыть;
	Элементы.СкрытьЛегенду.Видимость = Открыть;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервере
Процедура УстановитьТексты()
	
	Обработка = РеквизитФормыВЗначение("Объект");

	ТекстДляПоля = Обработка.ПолучитьМакет("ТекстДляКарты").ПолучитьТекст();
	ТекстДляПоля = СтрЗаменить(ТекстДляПоля, "ЭтоБудетЦентрКарты", "55.729381, 37.664576"); 
	
	ПолеЛегенды = Обработка.ПолучитьМакет("ТекстДляЛегенды").ПолучитьТекст();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеДляВыводаТочек()
	
	// Если ни один документ не отбирается - уходим
	Если Не ИспользоватьЗаявкиНаПускоНаладочныеРаботы 
		 И Не ИспользоватьЗаявкиНаРемонтныеРаботы
		Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Заявки.Очистить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтаФорма.Интервал.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", ЭтаФорма.Интервал.ДатаОкончания);
	
	ФорматнаяСтрокаПериода = "";
	Если ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаНачала) И ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаОкончания) Тогда
		ФорматнаяСтрокаПериода = "И Документ.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	ИначеЕсли ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаНачала) И Не ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаОкончания) Тогда
		ФорматнаяСтрокаПериода = "И Документ.Дата >= &НачалоПериода";
	ИначеЕсли Не ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаНачала) И ЗначениеЗаполнено(ЭтаФорма.Интервал.ДатаОкончания) Тогда
		ФорматнаяСтрокаПериода = "И Документ.Дата <= &КонецПериода";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИспользоватьЗаявкиНаПускоНаладочныеРаботы", ЭтаФорма.ИспользоватьЗаявкиНаПускоНаладочныеРаботы);
	Запрос.УстановитьПараметр("ЕстьФильтрСтатусыДокументовПНРИсключение", ЭтаФорма.СтатусЗаявкиНаПН.Количество() > 0);
	Запрос.УстановитьПараметр("МассивСтатусыДокументовПНРИсключение", ЭтаФорма.СтатусЗаявкиНаПН);
	
	Запрос.УстановитьПараметр("ИспользоватьЗаявкиНаРемонтныеРаботы", ЭтаФорма.ИспользоватьЗаявкиНаРемонтныеРаботы);
	Запрос.УстановитьПараметр("ЕстьФильтрСтатусыДокументовРРИсключение", ЭтаФорма.СтатусЗаявки.Количество() > 0);	
	Запрос.УстановитьПараметр("МассивСтатусыДокументовРРИсключение", ЭтаФорма.СтатусЗаявки);
	
	Запрос.УстановитьПараметр("ПодстрокаОборудования", "%" + ЭтаФорма.Модель + "%");
	Запрос.УстановитьПараметр("СегментVIPКлиентов", Справочники.смартПредопределенныеЗначения.СегментВИППартнеров.Значение); 
	
	Запрос.УстановитьПараметр("ЕстьФильтрПоВидуГарантии", ЗначениеЗаполнено(ЭтаФорма.ВидГарантии)); 
	Запрос.УстановитьПараметр("ВидГарантии", ЭтаФорма.ВидГарантии); 

	ТекстЗапроса = "";
	
	// Подготовка временной таблицы для Оборудования клиента (фильтр Модель)
	Если ЗначениеЗаполнено(ЭтаФорма.Модель) Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ 
		|	Ссылка 
		|ПОМЕСТИТЬ ВыбранноеОборудованиеКлиентов
		|ИЗ 
		|	Справочник.смартОборудованиеКлиентов 
		|ГДЕ 
		|	Наименование ПОДОБНО &ПодстрокаОборудования
		|;
		|";
		
	КонецЕсли;
	
	// Подготовка временной таблицы клиентов, входящих в VIP сегмент (фильтр Отбор по VIP статусу)
	Если ЭтаФорма.ОтборПоVIPСтатусу Тогда
		
		ТекстЗапроса = ТекстЗапроса + 
		"ВЫБРАТЬ 
		|	Партнер 
		|ПОМЕСТИТЬ ВыбранныеПартнерыVIP
		|ИЗ 
		|	РегистрСведений.ПартнерыСегмента 
		|ГДЕ 
		|	Сегмент = &СегментVIPКлиентов
		|;
		|";
		
	КонецЕсли;
	
	// Основное тело запрос 
	// На этом этапе запрос формируется для документа "Заявка на пуско-наладочные работы"
    ТекстЗапросаЗаявкаНаПускоНаладку = 
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |	Документ.Партнер				 						КАК Партнер,	
    |	Документ.АдресВыезда 									КАК АдресВыезда,
    |	Документ.Статус 										КАК Статус,
    |	Документ.НазначенныйНаЗапускИнженер 					КАК Инженер1,
    |	Документ.НазначенныйНаЗапускИнженер2 					КАК Инженер2,
    |	Документ.НазначеннаяДатаЗапускаС 						КАК ДатаРемонтаС,
    |	ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.ПустаяСсылка) 	КАК ВидГарантии,
    |	Документ.Широта 										КАК Широта,
    |	Документ.Долгота 										КАК Долгота,
    |	Документ.Номер 											КАК Номер,
    |	Документ.Ссылка 										КАК Заявка,
    |	Документ.Дата 											КАК Дата,
    |	Документ.Статус 										КАК СтатусПеречисление
	|
    |ИЗ
    |	Документ.смартЗаявкаНаПускоНаладку КАК Документ
	|";
	
	// Если используется фильтр Модель, то дополнительно проверяем оборудование
	Если ЗначениеЗаполнено(ЭтаФорма.Модель) Тогда
		
		ТекстЗапросаЗаявкаНаПускоНаладку = ТекстЗапросаЗаявкаНаПускоНаладку +
		"ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаПускоНаладку.Оборудование КАК ДокументОборудование
		|ПО 
		|	ДокументОборудование.Ссылка = Документ.Ссылка
		|	И ДокументОборудование.ОборудованиеКлиентов В (ВЫБРАТЬ Ссылка ИЗ ВыбранноеОборудованиеКлиентов)
		|";
		
	КонецЕсли;
	
	ТекстЗапросаЗаявкаНаПускоНаладку = ТекстЗапросаЗаявкаНаПускоНаладку +
    "ГДЕ
	|	&ИспользоватьЗаявкиНаПускоНаладочныеРаботы	
    |	И НЕ Документ.ПометкаУдаления
    |	И НЕ Документ.АдресВыезда = """"
    |	" + ФорматнаяСтрокаПериода + "
    |	И ВЫБОР
	|		КОГДА &ЕстьФильтрСтатусыДокументовПНРИсключение 
	|		ТОГДА Документ.Статус В (&МассивСтатусыДокументовПНРИсключение)
	|		ИНАЧЕ ИСТИНА
	|	  КОНЕЦ
	|";
	
	Если ЭтаФорма.ОтборПоVIPСтатусу Тогда
		
		ТекстЗапросаЗаявкаНаПускоНаладку = ТекстЗапросаЗаявкаНаПускоНаладку +	
	    "	И Документ.Партнер В (ВЫБРАТЬ Партнер ИЗ ВыбранныеПартнерыVIP) 
		|
		|";
		
	КонецЕсли;
	
	// Этап формирования второй части запроса для документа "Заявка на ремонтные работы"
	// Берем первую часть запроса и делаем подмены названий
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаПускоНаладку, "смартЗаявкаНаПускоНаладку", "смартЗаявкаНаРемонтныеРаботы");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "ЗНАЧЕНИЕ(Перечисление.смартВидыГарантии.ПустаяСсылка)", "ПРЕДСТАВЛЕНИЕ(Документ.ВидГарантии)");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "ИспользоватьЗаявкиНаПускоНаладочныеРаботы", "ИспользоватьЗаявкиНаРемонтныеРаботы");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "ЕстьФильтрСтатусыДокументовПНРИсключение", "ЕстьФильтрСтатусыДокументовРРИсключение");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "МассивСтатусыДокументовПНРИсключение", "МассивСтатусыДокументовРРИсключение");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "НазначенныйНаЗапускИнженер", "НазначенныйНаРемонтИнженер");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "НазначенныйНаЗапускИнженер2", "НазначенныйНаРемонтИнженер2");
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = СтрЗаменить(ТекстЗапросаЗаявкаНаРемонтныеРаботы, "НазначеннаяДатаЗапускаС", "НазначеннаяДатаРемонтаС");
	
	ТекстЗапросаЗаявкаНаРемонтныеРаботы = ТекстЗапросаЗаявкаНаРемонтныеРаботы + 
	"	И ВЫБОР
	|  		КОГДА &ЕстьФильтрПоВидуГарантии 
	|  		ТОГДА Документ.ВидГарантии = &ВидГарантии
	|  		ИНАЧЕ ИСТИНА
	|	  КОНЕЦ
	|	И НЕ Документ.Статус В (ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.ОшибочнаяЗаявка),
	|						    ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаРемонтныеРаботы.ЗаявкаАннулирована))
	|
	|УПОРЯДОЧИТЬ ПО Дата ВОЗР
	|";	
	                   
	ТекстЗапроса = ТекстЗапроса 
					+ ТекстЗапросаЗаявкаНаПускоНаладку
					+ "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС
					+ ТекстЗапросаЗаявкаНаРемонтныеРаботы;
					
	Запрос.Текст = ТекстЗапроса;

	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если Таблица.Количество() >= 700 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбрано слишком большое количество заявок.
														  |Пожалуйста, воспользуйтесь фильтрами.");
		
		Возврат;
		
	КонецЕсли;
	
	// Поиск строк с пустыми координатами с попыткой их получения
	НайденныеСтрокиСНеНайденнымиКоординатами = Таблица.НайтиСтроки(Новый Структура("Широта", 0));
	Для Каждого НайденнаяСтрока Из НайденныеСтрокиСНеНайденнымиКоординатами Цикл
		
		// Получает координаты и записывает их в объект заявки
		ПолучитьКоординаты(НайденнаяСтрока);	
		
	КонецЦикла;
		
	Объект.Заявки.Загрузить(Таблица);
	
КонецПроцедуры	

&НаСервере
Процедура ПолучитьКоординаты(ДанныеПоЗаявке)
	
	Адрес = ДанныеПоЗаявке.АдресВыезда;
	
	// Передаем Адрес контрагента в Яндекс для получения координат
	HTTPСоединение = Новый HTTPСоединение("geocode-maps.yandex.ru",443,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/1.x/?apikey=31ae08c0-bc0b-486f-bfeb-06de95a39df3&geocode=" + Адрес + "");
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Не HTTPОтвет.КодСостояния = 200 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при получении координат по адресу: " + Адрес + " 
														  | - " + ОписаниеОшибки());
		
		Возврат;
		
	КонецЕсли;		
	
	Попытка
		ЧтениеXML = Новый ЧтениеXML;
		ЧтениеXML.ОткрытьПоток(HTTPСоединение.Получить(HTTPЗапрос).ПолучитьТелоКакПоток());
	Исключение 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при получении координат по адресу: " + Адрес + " 
														  | - " + ОписаниеОшибки());
		
		Возврат;

	КонецПопытки;
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументДОМ = ПостроительDOM.Прочитать(ЧтениеXML);
	
	СписокText = ДокументДОМ.ПолучитьЭлементыПоИмени("text");
	СписокPos = ДокументДОМ.ПолучитьЭлементыПоИмени("pos");
		
	Если СписокText.Количество() = 0 Или СписокPos.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка при получении координат по адресу: " + Адрес);
		Возврат;
		
	КонецЕсли;
	
	Для ИндексСписка = 0 По СписокText.Количество() - 1 Цикл
		
		Координаты = СписокPos[ИндексСписка].ТекстовоеСодержимое;
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Координаты, " ", Истина);
		
		Долгота = 0;
		Широта	= 0;
		
		Если МассивПодстрок.Количество() >= 2 Тогда
			
			Долгота = Число(МассивПодстрок[0]);
			Широта	= Число(МассивПодстрок[1]);
			
		КонецЕсли;
		
		Если Широта = 0 Или Долгота = 0 Тогда
			Продолжить;
		Иначе	
			
			ЗаявкаДокументОбъект = ДанныеПоЗаявке.Заявка.ПолучитьОбъект();
			ЗаявкаДокументОбъект.Широта = Широта;
			ЗаявкаДокументОбъект.Долгота = Долгота;
			ЗаявкаДокументОбъект.ОбменДанными.Загрузка = Истина;
			
			ЗаявкаДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			ДанныеПоЗаявке.Широта = Широта;
			ДанныеПоЗаявке.Долгота = Долгота;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьКарту(ТекущаяЗаявка)
	
	ПолеКарты = "";
	ТекстДляМеток = "";
	
	// Формируем HTML-текст для отображения в HTML-поле обработки
	// Шаблоны текстов хранятся в макетах обработки и загружаются в реквизиты формы (см. УстановитьТексты) 
	// Важно! Формируется текст для всех заявок, которые есть в таблице Заявки. При этом, в центр карты попадает
	// 	та заявка, которая выбрана пользователем. 
	Для Каждого СтрокаТаблицы Из Объект.Заявки Цикл
		
		Если СтрокаТаблицы.Широта = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийИндексСтрокой 	= Строка(Объект.Заявки.Индекс(СтрокаТаблицы) + 1);	
		
		ШиротаСтрокой 			= СтрЗаменить(Строка(СтрокаТаблицы.Широта), ",", ".");
		ДолготаСтрокой 			= СтрЗаменить(Строка(СтрокаТаблицы.Долгота), ",", ".");
		ПартнерСтрокой 			= Строка(СтрокаТаблицы.Партнер);
		Инженер1Строкой 		= Строка(СтрокаТаблицы.Инженер1); 
		Инженер2Строкой 		= Строка(СтрокаТаблицы.Инженер2); 
		НомерДокумента 			= СокрЛП(СтрокаТаблицы.Номер);
		ДатаРемонтаСтрокой 		= Формат(СтрокаТаблицы.ДатаРемонтаС, "ДФ=dd.MM.yyyy");
		СтатусСтрокой 			= Строка(СтрокаТаблицы.Статус);
		ВидГарантииСтрокой 		= Строка(СтрокаТаблицы.ВидГарантии);
		
		ТекстДляМеток = ТекстДляМеток
						+ ?(ТекстДляМеток = "", "", "; " + Символы.ПС)
						+ "var myPlacemark" + ТекущийИндексСтрокой
						+ Символы.ПС
						+ " = new ymaps.Placemark([" + ШиротаСтрокой + ", " + ДолготаСтрокой + "], {"
						+ Символы 	.ПС
						+ "    hintContent: '" + ПартнерСтрокой + "',"
						+ Символы.ПС
						+ "    balloonContent: ' Инженер1: " + Инженер1Строкой
						+ ?(ПустаяСтрока(Инженер2Строкой), "", ", Инженер2: " + Инженер2Строкой)
						+ ", № заявки: " + НомерДокумента
						+ ", Дата ремонта: " + ДатаРемонтаСтрокой
						+ ", Статус: " + СтатусСтрокой
						+ ?(ПустаяСтрока(ВидГарантииСтрокой), "", ", Вид гарантии: " + ВидГарантииСтрокой) + "'"
						+ Символы.ПС
						+ "} "
						+ ?(ТекущаяЗаявка = СтрокаТаблицы.Заявка,
								",{'preset': 'islands#nightDotIcon'}",
								",{'preset': '" + ПолучитьЦветпоСтатусу(СтрокаТаблицы.СтатусПеречисление) + "'}")
						+ ");" + Символы.ПС
						+ "myMap.geoObjects.add(myPlacemark" + ТекущийИндексСтрокой + ")";
						
						// Пример
						//	var myPlacemark1
						// 	 = new ymaps.Placemark([45.030228, 39.049164], {
						//    hintContent: 'ИЗОСТУДИЯ',
						//    balloonContent: ' Инженер1: Юнаш Ярослав Валерьевич, № заявки: 208060, Дата ремонта: 01.09.2023, Статус: Ремонт завершен'
						//	} ,{'preset': 'islands#blackDotIcon'});
						//	myMap.geoObjects.add(myPlacemark1)						
						
		Если ТекущаяЗаявка = СтрокаТаблицы.Заявка Тогда
			
			// Устанавливается позиция карты на ту заявку, которую выбрал пользователь в таблице "Заявки"
			ТекстПоляКарты = СтрЗаменить(ТекстДляПоля, "ЭтоБудетЦентрКарты", ШиротаСтрокой + ", " + ДолготаСтрокой);
			ТекстПоляКарты = СтрЗаменить(ТекстПоляКарты, "55.729381, 37.664576", ШиротаСтрокой + ", " + ДолготаСтрокой);
			
		КонецЕсли;
		
	КонецЦикла;

	ПолеКарты = СтрЗаменить(ТекстПоляКарты, "ЗдесьБудутМетки", ТекстДляМеток);

КонецПроцедуры

&НаСервере
Процедура ПолучитьОстаткиЗапросов()
	
	// Запрашиваем у Яндекс доступный остаток запросов к их сервису
	HTTPСоединение = Новый HTTPСоединение("api-developer.tech.yandex.net", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("projects/5d0079b5-dcc7-43b9-a204-e5d8f2a72b02/services/apimaps/limits");
	HTTPЗапрос.Заголовки.Вставить("X-Auth-Key", "765b8583-a373-4218-92ee-83dc5d4f0de0");
	
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если Не HTTPОтвет.КодСостояния = 200 Тогда
		
		ЭтаФорма.ОсталосьЗапросов = "Недоступно";
		Элементы.ДекорацияПояснение.Заголовок = "Не удалось подключится к сервису. Код состояния " 
													+ Строка(HTTPОтвет.КодСостояния);
		Возврат;
		
	КонецЕсли;	
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(HTTPОтвет.ПолучитьТелоКакПоток()); 
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Если СтруктураОтвета.Свойство("limits") Тогда
		
		Если СтруктураОтвета.limits.Свойство("apimaps_total_daily") Тогда
			
			КоличествоЗапросовВсего = СтруктураОтвета.limits.apimaps_total_daily.limit;
			КоличествоЗапросовИспользовано = СтруктураОтвета.limits.apimaps_total_daily.value;
			КоличествоЗапросовОстаток = КоличествоЗапросовВсего - КоличествоЗапросовИспользовано;
			
			ЭтаФорма.ОсталосьЗапросов = Строка(КоличествоЗапросовОстаток);
			Элементы.ДекорацияПояснение.Заголовок = "Лимит запросов на сегодня " + Формат(КонецДня(ТекущаяДата()), "ДФ=dd.MM.yyyy") 
														+ " = " + Строка(КоличествоЗапросовВсего) + "." 
														+ " Использовано сегодня " + Строка(КоличествоЗапросовИспользовано); 
			
		Иначе
			
			ЭтаФорма.ОсталосьЗапросов = "Недоступно";
			Элементы.ДекорацияПояснение.Заголовок = "Недоступно";			
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьЦветпоСтатусу(СтатусПеречисление)
	
	Если СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.НоваяЗаявка Тогда
		Возврат "islands#redDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПолученаВРаботу Тогда
		Возврат "islands#pinkDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.СозвонилисьСКлиентом Тогда
		Возврат "islands#orangeDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ОтправленаВПредставительство Тогда
		Возврат "islands#yellowDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.НазначенИнженер Тогда
		Возврат "islands#darkGreenDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ТребуетсяПовторныйВыезд Тогда
		Возврат "islands#oliveDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтЗавершен Тогда
		Возврат "islands#blackDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.РемонтОсуществленПоТелефону Тогда
		Возврат "islands#blackDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ПовторныйВыезд Тогда
		Возврат "islands#greenDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаРемонтныеРаботы.ЖдемЗапчасти Тогда
		Возврат "islands#brownDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Размещена Тогда
		Возврат "islands#redCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ПолученаВРаботу Тогда
		Возврат "islands#pinkCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.СозвонилисьСКлиентом Тогда
		Возврат "islands#orangeCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.НазначенИнженер Тогда
		Возврат "islands#darkGreenCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ОтправленаВПредставительство Тогда
		Возврат "islands#yellowCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.Выполнена Тогда
		Возврат "islands#blackCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ВыполненаДистанционно Тогда
		Возврат "islands#blackCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.КлиентЗапустилОборудованиеСамостоятельно Тогда
		Возврат "islands#blackCircleDotIcon";
	ИначеЕсли СтатусПеречисление = Перечисления.смартСтатусыЗаявокНаПускоНаладку.ТребуетКорректировки Тогда
		Возврат "islands#greenCircleDotIcon";
	Иначе
		Возврат "islands#redDotIcon"
	КонецЕсли;
	
КонецФункции	

#КонецОбласти
 //--#1503 смарт: Ермаков 19.10.2023 // Интерактивная карта в 1C (продолжение 1248)
